In [1]:
# Import needed libraries
import sys
notebook_path = sys.path.append(r'e:\Data science\Titanic dataset\notebooks')

from auto_imports import *


df = pd.read_csv('E:\Data science\Titanic dataset\data\Processed data\Data Analysis\cleaned data.csv')

<>:8: SyntaxWarning: invalid escape sequence '\D'
<>:8: SyntaxWarning: invalid escape sequence '\D'
C:\Users\MinaAlber\AppData\Local\Temp\ipykernel_1384\369161819.py:8: SyntaxWarning: invalid escape sequence '\D'
  df = pd.read_csv('E:\Data science\Titanic dataset\data\Processed data\Data Analysis\cleaned data.csv')

### Feature engineering

In [2]:
# Show first rows of dataframe
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,ind
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,C23 C25 C27,S,train
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,train
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,C23 C25 C27,S,train
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,train
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,C23 C25 C27,S,train

split cabin column to cabin cell and cabin number

In [3]:
# Show Cabin column values
df['Cabin']

0       C23 C25 C27
1               C85
2       C23 C25 C27
3              C123
4       C23 C25 C27
           ...
1281    C23 C25 C27
1282           C105
1283    C23 C25 C27
1284    C23 C25 C27
1285    C23 C25 C27
Name: Cabin, Length: 1286, dtype: object

In [4]:
def remove_duplicate_letters(text):
        seen = set()
        result = ''
        for char in text:
            if char not in seen:
                seen.add(char)
                result += char
        return result.strip().replace(' ' , '-')

# splitting cabin column to cabin and cell number 
df['cell_number'] = df['Cabin'].replace(r'[a-zA-Z]' , '' , regex =True).str.strip().str.replace(' ' , '-')
df.drop(df[df['cell_number'] == ''].index , inplace=True)
df['Cabin_letter'] = df['Cabin'].replace(r'[0-9]' , '' , regex = True).apply(remove_duplicate_letters)
# When removing digits from cabin column values output may be like that (B B B B) so I maked a function to remove this duplicted letters

In [5]:
# Show unique cabin letters
df['Cabin_letter'].unique()

array(['C', 'E', 'G', 'D', 'A', 'B', 'F', 'F-G', 'F-E'], dtype=object)

In [6]:
# Show unique cell numbers
df['cell_number'].unique()

array(['23-25-27', '85', '123', '46', '6', '103', '56', '78', '33', '30',
       '52', '83', '73', '31', '5', '10-12', '26', '110', '58-60', '101',
       '69', '47', '86', '2', '19', '7', '49', '4', '32', '80', '36',
       '15', '93', '35', '87', '77', '67', '94', '125', '99', '118',
       '22-26', '106', '65', '54', '57-59-63-66', '34', '18', '124', '91',
       '40', '128', '37', '50', '82', '96-98', '44', '104', '111', '92',
       '38', '21', '12', '63', '14', '20', '79', '25', '95', '39', '22',
       '70', '16', '68', '10', '41', '9', '23', '48', '58', '126', '71',
       '51-53-55', '62-64', '24', '90', '45', '8', '121', '11', '3',
       '82-84', '17', '102', '28', '42', '148', '61', '53', '43', '130',
       '132', '55-57', '116', '29', '51', '97', '89', '57', '60', '39-41',
       '52-54-56', '105'], dtype=object)

In [7]:
# Count missing cell numbers
df['cell_number'].isna().sum()

np.int64(0)

In [8]:
# Drop Cabin column after splitting
df.drop('Cabin' , axis =1 , inplace=True)

In [9]:
# Show first rows after cabin processing
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,ind,cell_number,Cabin_letter
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S,train,23-25-27,C
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,train,85,C
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S,train,23-25-27,C
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S,train,123,C
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S,train,23-25-27,C

I want to extract some important information from name column. Then I will drop it

In [10]:
# Show first name value
df['Name'][0]

'Braund, Mr. Owen Harris'

- I will extract family name from the first word and title from the second word 
> Last thing I want to see names have a brackets. What do brackets refer to?

Now let's titles

In [11]:
# Show value counts of titles extracted from Name
df['Name'].str.split(r'[,.]').str[1].str.strip().value_counts()

Name
Mr              734
Miss            259
Mrs             194
Master           60
Rev               8
Dr                8
Col               4
Major             2
Ms                2
Mlle              2
Don               1
Mme               1
Lady              1
Capt              1
the Countess      1
Jonkheer          1
Dona              1
Name: count, dtype: int64

In [12]:
# Extract Title from Name
df['Title'] = df['Name'].str.split(r'[,.]').str[1].str.strip()

In [13]:
# Extract FamilyName and drop Name column
df['FamilyName'] =df['Name'].str.split(',').str[0].str.strip()
df.drop('Name' , axis = 1 , inplace=True)

In [14]:
# Show first rows after name processing
df.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,ind,cell_number,Cabin_letter,Title,FamilyName
0,1,0.0,3,male,22.0,1,0,A/5 21171,7.2500,S,train,23-25-27,C,Mr,Braund
1,2,1.0,1,female,38.0,1,0,PC 17599,71.2833,C,train,85,C,Mrs,Cumings
2,3,1.0,3,female,26.0,0,0,STON/O2. 3101282,7.9250,S,train,23-25-27,C,Miss,Heikkinen
3,4,1.0,1,female,35.0,1,0,113803,53.1000,S,train,123,C,Mrs,Futrelle
4,5,0.0,3,male,35.0,0,0,373450,8.0500,S,train,23-25-27,C,Mr,Allen

Now let's extract some important information from ticket column like 

1. route/agent
2. batch/timeframe
3. SharedTicket(1 , 0)

In [15]:
# Split Ticket column for further processing
df['Ticket'].str.split()

0                [A/5, 21171]
1                 [PC, 17599]
2         [STON/O2., 3101282]
3                    [113803]
4                    [373450]
                ...
1281             [A.5., 3236]
1282              [PC, 17758]
1283    [SOTON/O.Q., 3101262]
1284                 [359309]
1285                   [2668]
Name: Ticket, Length: 1280, dtype: object

In [16]:
# I want to update only_character variable
clean_agents = df['Ticket'].str.extract(r'^([A-Za-z/.]+\d*)', expand=False).fillna('Non-special').replace('[.]' , '' , regex=True)

In [17]:
# Show unique special agent/route values
clean_agents.unique()

# That's perfect

array(['A/5', 'PC', 'STON/O2', 'Non-special', 'PP', 'CA', 'SC/Paris',
       'SC/A4', 'A/4', 'SP', 'SOC', 'SO/C', 'W/C', 'SOTON/OQ', 'WEP',
       'STON/O', 'A4', 'C', 'SC/PARIS', 'SOP', 'A5', 'Fa', 'LINE', 'FCC',
       'SW/PP', 'SCO/W', 'P/PP', 'SC', 'SC/AH', 'A/S', 'WE/P', 'SO/PP',
       'FC', 'SOTON/O2', 'CA/SOTON', 'SC/A3', 'STON/OQ', 'AQ/4', 'A',
       'LP', 'AQ/3'], dtype=object)

In [18]:
# Add special agent/route column
df['Special Agent/route'] = clean_agents

Make Ticket batch column

In [19]:
# Extract ticket digits for batch classification
ticket_digits = df['Ticket'].str.split().str[-1]
ticket_digits.str.len().unique()

array([5, 7, 6, 4, 3, 1])

In [20]:
# Show ticket digits with length 1
ticket_digits[ticket_digits.str.len() == 1]

758     3
825     3
1057    2
1172    2
Name: Ticket, dtype: object

In [21]:
# Get corrected values for tickets with length 1
corrected_values = df.iloc[ticket_digits[ticket_digits.str.len() == 1].index]['Ticket'].values
corrected_values

array(['383121', 'C.A. 5547', '111163', '12749'], dtype=object)

In [22]:
# Assign corrected values to ticket_digits
ticket_digits[ticket_digits.str.len() == 1] = corrected_values

In [23]:
# Check unique lengths after correction
ticket_digits.str.len().unique()

array([5, 7, 6, 4, 3, 9])

In [24]:
# Show unique ticket digits
ticket_digits.unique()

array(['21171', '17599', '3101282', '113803', '373450', '330877', '17463',
       '349909', '347742', '237736', '9549', '113783', '2151', '347082',
       '350406', '248706', '382652', '244373', '345763', '2649', '239865',
       '248698', '330923', '113788', '347077', '2631', '19950', '330959',
       '349216', '17601', '17569', '335677', '24579', '17604', '113789',
       '2677', '2152', '345764', '2651', '7546', '11668', '349253',
       '2123', '330958', '23567', '370371', '14311', '2662', '349237',
       '3101295', '39886', '17572', '2926', '113509', '19947', '31026',
       '2697', '34651', '2144', '2669', '36973', '347088', '17605',
       '2661', '29395', '3464', '3101281', '315151', '33111', '14879',
       '2680', '1601', '348123', '349208', '374746', '248738', '364516',
       '345767', '345779', '330932', '113059', '14885', '3101278', '6608',
       '392086', '343275', '343276', '347466', '5734', '2315', '364500',
       '374910', '17754', '17759', '231919', '244367', '349245', '35281',
       '7540', '3101276', '349207', '343120', '312991', '349249',
       '371110', '110465', '2665', '324669', '4136', '2627', '3101294',
       '370369', '17558', '54510', '27267', '370372', '17369', '2668',
       '347061', '349241', '3101307', '3337', '228414', '29178', '2133',
       '11752', '7534', '17593', '2678', '347081', '3101279', '365222',
       '231945', '33112', '244310', '1166', '113776', '11206', '851',
       '265302', '17597', '35851', '392090', '315037', '2343', '371362',
       '33595', '347068', '315093', '363291', '113505', '17318', '111240',
       '3101280', '17764', '350404', '4133', '17595', '250653', 'LINE',
       '2131', '230136', '315153', '113767', '370365', '364849', '349247',
       '234604', '28424', '350046', '230080', '17610', '368703', '4579',
       '370370', '248747', '345770', '3101264', '2628', '3540', '347054',
       '2699', '367231', '112277', '3101311', '13528', '21174', '250646',
       '367229', '35273', '3101283', '243847', '11813', '14208', '392089',
       '220367', '21440', '349234', '19943', '4348', '751', '236171',
       '347067', '237442', '29566', '6609', '26707', '31921', '28665',
       '1585', '367230', '14263', '3101275', '2694', '19928', '347071',
       '250649', '11751', '244252', '362316', '113514', '3336', '370129',
       '2650', '17585', '110152', '17755', '230433', '384461', '110413',
       '112059', '382649', '17248', '347083', '17582', '17760', '113798',
       '250644', '17596', '370375', '13502', '347073', '239853', '2673',
       '336439', '347464', '345778', '10482', '113056', '349239',
       '345774', '349206', '237798', '370373', '19877', '11967', '349236',
       '349233', '17612', '2693', '113781', '19988', '9234', '367226',
       '226593', '2466', '17421', '17758', '3381', '17485', '11767',
       '17608', '250651', '349243', '13529', '347470', '29011', '36928',
       '16966', '21172', '349219', '234818', '345364', '111361', '113043',
       '17611', '349225', '7598', '248740', '244361', '229236', '248733',
       '31418', '386525', '37671', '315088', '7267', '113510', '2695',
       '2647', '345783', '237671', '330931', '330980', '2167', '2691',
       '3101310', '7076', '110813', '2626', '14313', '17477', '11765',
       '3101267', '323951', '7077', '113503', '2648', '347069', '17757',
       '2653', '3101293', '349227', '27849', '367655', '1748', '113760',
       '350034', '3101277', '350052', '350407', '28403', '244278',
       '240929', '3101289', '341826', '4137', '315096', '28664', '347064',
       '29106', '312992', '349222', '394140', '3101269', '343095',
       '28220', '250652', '28228', '345773', '349254', '13032', '315082',
       '347080', '34244', '2003', '250655', '364851', '110564', '376564',
       '3085', '3101274', '13507', '18723', '345769', '347076', '230434',
       '65306', '33638', '113794', '2666', '113786', '65303', '113051',
       '17453', '2817', '349240', '13509', '17464', '13531', '371060',
       '19952', '364506', '111320', '234360', '2816', '3101306', '113792',
       '36209', '323592', '315089', '7553', '31027', '3460', '350060',
       '3101298', '239854', '3594', '4134', '11771', '18509', '65304',
       '3101317', '113787', '17609', '45380', '36947', '6212', '350035',
       '315086', '364846', '330909', '4135', '26360', '4001', '382651',
       '3101316', '17473', '17603', '349209', '36967', '34260', '226875',
       '349242', '12749', '349252', '2624', '2700', '367232', '14258',
       '17483', '3101296', '29104', '2641', '2690', '315084', '113050',
       '17761', '364498', '13568', '5735', '2908', '693', '2146',
       '244358', '330979', '347085', '113807', '11755', '345572',
       '372622', '349251', '218629', '392082', '392087', '48871',
       '349205', '2686', '350417', '752', '11769', '14312', '20589',
       '358585', '243880', '2689', '3101286', '237789', '13049', '3411',
       '237565', '13567', '14973', '3235', '3101273', '3902', '364848',
       '29037', '248727', '2664', '349214', '113796', '364511', '349910',
       '349246', '113804', '3101305', '370377', '364512', '220845',
       '31028', '2659', '11753', '350029', '54636', '36963', '219533',
       '349224', '334912', '27042', '347743', '13214', '112052', '237668',
       '3101292', '350050', '349231', '13213', '2314', '349221', '8475',
       '330919', '365226', '349223', '29751', '2623', '5727', '349210',
       '3101285', '234686', '312993', '3536', '19996', '29750', '12750',
       '24580', '244270', '239856', '349912', '342826', '4138', '330935',
       '6563', '349228', '350036', '24160', '17474', '349256', '2672',
       '113800', '248731', '363592', '35852', '348121', '17475', '36864',
       '350025', '223596', '17476', '17482', '113028', '7545', '250647',
       '348124', '34218', '36568', '347062', '350048', '12233', '250643',
       '113806', '315094', '36866', '236853', '3101271', '239855',
       '28425', '233639', '349201', '349218', '16988', '376566',
       '3101288', '250648', '113773', '335097', '29103', '392096',
       '345780', '349204', '350042', '29108', '363294', '3101272', '2663',
       '347074', '112379', '364850', '8471', '345781', '350047', '383121',
       '2674', '29105', '347078', '36865', '2687', '113501', '6607',
       '3101312', '3101265', '12460', '17600', '349203', '28213', '17465',
       '349244', '2685', '2625', '347089', '347063', '112050', '347087',
       '248723', '3474', '28206', '364499', '112058', '3101290', '2079',
       '7075', '315098', '19972', '368323', '367228', '2671', '347468',
       '2223', '17756', '315097', '392092', '11774', '3101287',
       'C.A. 5547', '2683', '315090', '5547', '349213', '347060', '17592',
       '392091', '113055', '2629', '350026', '28134', '17466', '233866',
       '236852', '2149', '17590', '345777', '349248', '695', '345765',
       '2667', '349212', '349217', '349257', '7552', '34068', '392076',
       '211536', '112053', '111369', '370376', '330911', '363272',
       '240276', '315154', '7538', '330972', '2657', '349220', '694',
       '21228', '24065', '233734', '2692', '3101270', '2696', '17368',
       '17598', '2698', '113054', '31029', '13236', '342712', '315087',
       '345768', '113778', '3101263', '237249', '3101291', '17594',
       '370374', '13695', '2168', '2861', '349230', '348122', '349232',
       '237216', '347090', '334914', '13534', '330963', '2543', '382653',
       '349211', '3101297', '17562', '359306', '11770', '248744',
       '368702', '19924', '349238', '240261', '2660', '330844', '31416',
       '364856', '347072', '345498', '376563', '13905', '350033',
       '3101268', '347471', '3338', '11778', '365235', '347070', '330920',
       '383162', '237734', '330968', '17531', '329944', '2681', '13050',
       '367227', '392095', '368783', '350045', '211535', '342441',
       '369943', '113780', '2621', '349226', '350409', '2656', '248659',
       '392083', '23568', '113791', '349255', '350405', '347469',
       '110489', '3101315', '335432', '220844', '343271', '237393',
       '17591', '17770', '7548', '251', '2670', '233478', '7935',
       '239059', '111163', '48873', '28221', '235509', '347465', '347066',
       '31030', '65305', '34050', '12998', '9232', '28034', '17613',
       '349250', '3101308', '347091', '113038', '330924', '32302', '2148',
       '342684', '14266', '350053', '17606', '350054', '370368', '242963',
       '113795', '3101266', '330971', '350416', '2679', '250650',
       '112377', '3470', '3101284', '13508', '7266', '345775', '42795',
       '3130', '363611', '28404', '345501', '350410', '34644', '349235',
       '112051', '49867', '39186', '315095', '368573', '2676', '14888',
       '31352', '14260', '315085', '364859', '21175', '2655', '1478',
       '17607', '382650', '2652', '345771', '349202', '113801', '347467',
       '347079', '315092', '383123', '112901', '315091', '2658', '1588',
       '368364', '30631', '28004', '350408', '347075', '2654', '244368',
       '113790', '3101309', '236854', '17580', '2684', '349229', '110469',
       '244360', '2675', '2622', '15185', '350403', '348125', '237670',
       '2688', '248726', '13540', '113044', '1222', '368402', '315083',
       '112378', '2147', '28133', '248746', '315152', '29107', '680',
       '366713', '330910', '2159', '349911', '244346', '364858', '30769',
       '371109', '347065', '21332', '17765', '28666', '334915', '365237',
       '347086', '3236', '3101262', '359309'], dtype=object)

In [25]:
# Create TicketBatch column: 1 for early, 0 for late
df['TicketBatch'] = np.where(ticket_digits.str.len() < 5 , 1,0)

1: Early<br>
0: Late

Let's make boolean column called shared ticket

In [26]:
# Create SharedTicket column: 1 if ticket is duplicated, else 0
df['SharedTicket'] = np.where(df['Ticket'].duplicated() , 1 , 0)

In [27]:
# Extract first digit from Ticket (not used further)
first_digit_ticket = df['Ticket'].str.extract(r'([0-9]+)')[0]
first_digit_ticket

0             5
1         17599
2             2
3        113803
4        373450
         ...
1281          5
1282      17758
1283    3101262
1284     359309
1285       2668
Name: 0, Length: 1280, dtype: object

In [28]:
# Show first 5 Ticket values
df['Ticket'].head()

0           A/5 21171
1            PC 17599
2    STON/O2. 3101282
3              113803
4              373450
Name: Ticket, dtype: object

In [29]:
# Drop Ticket column after feature extraction
df.drop('Ticket' , axis = 1 , inplace=True)

In [30]:
# Show random sample of dataframe
df.sample(10)

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked,ind,cell_number,Cabin_letter,Title,FamilyName,Special Agent/route,TicketBatch,SharedTicket
391,398,0.0,2,male,46.000000,0,0,26.0000,S,train,23-25-27,C,Mr,McKane,Non-special,0,0
867,884,0.0,2,male,28.000000,0,0,10.5000,S,train,23-25-27,C,Mr,Banfield,CA/SOTON,0,0
592,604,0.0,3,male,44.000000,0,0,8.0500,S,train,23-25-27,C,Mr,Torber,Non-special,0,0
1202,1225,NaN,3,female,19.000000,1,1,15.7417,C,test,23-25-27,C,Mrs,Nakid,Non-special,1,1
1187,1209,NaN,2,male,19.000000,0,0,10.5000,S,test,23-25-27,C,Mr,Rogers,Non-special,0,0
19,20,1.0,3,female,29.881138,0,0,7.2250,C,train,23-25-27,C,Mrs,Masselmani,Non-special,1,0
1044,1065,NaN,3,male,29.881138,0,0,7.2292,C,test,23-25-27,C,Mr,Torfa,Non-special,1,0
886,903,NaN,1,male,46.000000,0,0,26.0000,S,test,23-25-27,C,Mr,Jones,Non-special,1,0
358,365,0.0,3,male,29.881138,1,0,15.5000,Q,train,23-25-27,C,Mr,O'Brien,Non-special,0,1
131,134,1.0,2,female,29.000000,1,0,26.0000,S,train,23-25-27,C,Mrs,Weisz,Non-special,0,0

In [31]:
# Show dataframe info
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1280 entries, 0 to 1285
Data columns (total 17 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   PassengerId          1280 non-null   int64
 1   Survived             871 non-null    float64
 2   Pclass               1280 non-null   int64
 3   Sex                  1280 non-null   object
 4   Age                  1280 non-null   float64
 5   SibSp                1280 non-null   int64
 6   Parch                1280 non-null   int64
 7   Fare                 1280 non-null   float64
 8   Embarked             1280 non-null   object
 9   ind                  1280 non-null   object
 10  cell_number          1280 non-null   object
 11  Cabin_letter         1280 non-null   object
 12  Title                1280 non-null   object
 13  FamilyName           1280 non-null   object
 14  Special Agent/route  1280 non-null   object
 15  TicketBatch          1280 non-null   int64
 16  SharedTicket         1280 non-null   int64
dtypes: float64(3), int64(6), object(8)
memory usage: 212.3+ KB

In [ ]:
# saving them 
df.to_csv('E:\Data science\Titanic dataset\data\Processed data\Data Analysis\processed_data.csv' , index=False)

: